Repository: NguyenQuangHuyGit/AMIS_DEMO_BE
Catalog: MISA.AMIS.DEMO.Core/Resources/MISAResources.*.resx
Languages: vi_vn

source: customer
vi_vn: khách hàng

source: employee
vi_vn: nhân viên

# Enum_Female
source: Female
vi_vn: Nữ

# Enum_Male
source: Male
vi_vn: Nam

# Enum_Other
source: Other
vi_vn: Khác

# InValidMsg_AddressTooLong
source: The address must not exceed 255 characters
vi_vn: Địa chỉ không được vượt quá 255 kí tự

# InValidMsg_AuthenticationFail
source: Authentication failed
vi_vn: Xác thực thất bại

# InValidMsg_BankAccountTooLong
source: Bank account must not exceed 20 characters
vi_vn: Tải khoản ngân hàng không được vượt quá 20 kí tự

# InValidMsg_BankBranchTooLong
source: Bank branch must not exceed 100 characters
vi_vn: Chi nhánh ngân hàng không được vượt quá 100 kí tự

# InValidMsg_BankNameTooLong
source: Bank name must not exceed 100 characters
vi_vn: Tên ngân hàng không được vượt quá 100 kí tự

# InValidMsg_CantGetNewCode
source: Can't get new code. Please try again later
vi_vn: Không lấy được mã Code mới. Vui lòng thử lại sau.

# InValidMsg_DataImportIsEmpty
source: Import data is empty
vi_vn: Dữ liệu nhập khẩu bị trống

# InValidMsg_DateIdentityInvalid
source: Issue date is not in correct date format
vi_vn: Ngày cấp sai định dạng ngày tháng.

# InValidMsg_DateMustBefore
source: The selected date cannot be greater than the current date
vi_vn: Ngày đã chọn không được lớn hơn ngày hiện tại.

# InValidMsg_DateOfBirthInvalid
source: Date of birth is not in correct date format
vi_vn: Ngày sinh sai định dạng ngày tháng.

# InValidMsg_DateType
source: Incorrect date format
vi_vn: Không đúng định dạng ngày tháng.

# InValidMsg_DepartmentCodeRequired
source: Department code is required
vi_vn: Mã phòng ban không được để trống.

# InValidMsg_DepartmentCodeTooLong
source: Department code must not exceed 20 characters.
vi_vn: Mã phòng ban không được quá 20 kí tự.

# InValidMsg_DepartmentInvalid
source: Invalid department
vi_vn: Phòng ban không hợp lệ

# InValidMsg_DepartmentNameRequired
source: Department name is required
vi_vn: Tên phòng ban không được để trống.

# InValidMsg_DepartmentRequired
source: Department is required
vi_vn: Phòng ban không được để trống.

# InValidMsg_DuplicateEmployeeCode
source: Employee code <{0}> already exists in the system
vi_vn: Mã nhân viên <{0}> đã tồn tại trong hệ thống

# InValidMsg_DuplicateInput
source: Duplicate error
vi_vn: Lỗi trùng lặp.

# InValidMsg_DuplicatePhoneNumber
source: Phone number <{0}> is registered
vi_vn: Số điện thoại <{0}> đã được đăng kí

# InValidMsg_EmailTooLong
source: Email must not exceed 100 characters
vi_vn: Email không được vượt quá 100 kí tự

# InValidMsg_EmployeeCodeInvalidImport
source: The employee code already exists in the system
vi_vn: Mã nhân viên đã tồn tại trong hệ thống.

# InValidMsg_EmployeeCodeInvalidImportInFile
source: The employee code already exists on the import file
vi_vn: Mã nhân viên đã tồn tại trên tệp nhập khẩu.

# InValidMsg_EmployeeCodeRequired
source: Employee code is required
vi_vn: Mã nhân viên không được để trống.

# InValidMsg_EmployeeCodeTooLong
source: Employee code must not exceed 20 characters
vi_vn: Mã nhân viên không được quá 20 kí tự.

# InValidMsg_FileInvalidFormat
source: The file is not in the correct format provided
vi_vn: File không đúng định dạng đã cung cấp.

# InValidMsg_FileInvalidLenght
source: The file is empty, please check again
vi_vn: File đang trống, vui lòng kiểm tra lại.

# InValidMsg_FileInvalidType
source: The file provided is invalid, only '.xlsx' files are accepted
vi_vn: File cung cấp không hợp lệ, chỉ nhận file xlsx.

# InValidMsg_FullNameRequired
source: Full name is required
vi_vn: Họ tên không được để trống.

# InValidMsg_FullNameTooLong
source: Full name must not exceed 100 characters
vi_vn: Họ tên không quá 100 kí tự.

# InValidMsg_IdentityNumberTooLong
source: Citizen identification card must not exceed 25 characters
vi_vn: Căn cước công dân không được quá 25 kí tự

# InValidMsg_IdentityPlaceTooLong
source: Place of issue cannot exceed 100 characters
vi_vn: Nơi cấp không được vượt quá 100 kí tự

# InValidMsg_ImportDataNotExistInCache
source: Imported data is deleted from Cache
vi_vn: Dữ liệu nhập khẩu bị xóa khỏi Cache

# InValidMsg_ImportTImeOut
source: Data import session expired
vi_vn: Phiên nhập khẩu dữ liệu hết hạn

# InValidMsg_InValidDateOfBirth
source: Date of birth cannot be greater than current date
vi_vn: Ngày sinh không được lớn hơn ngày hiện tại

# InValidMsg_InvalidEmail
source: Invalid email
vi_vn: Email không hợp lệ.

# InValidMsg_InValidIdentityDate
source: The issue date cannot be greater than the current date
vi_vn: Ngày cấp không được lớn hơn ngày hiện tại

# InValidMsg_InValidInformation
source: Incorrect information
vi_vn: Thông tin không chính xác.

# InValidMsg_InValidInput
source: Input error
vi_vn: Lỗi nhập liệu.

# InValidMsg_InvalidPrefixEmployeeCode
source: The employee code must begin with the prefix "NV-"
vi_vn: Mã nhân viên phải bắt đầu với tiền tố "NV-"

# InValidMsg_InvalidSuffixEmployeeCode
source: The employee code suffix must be digits
vi_vn: Hậu tố của mã nhân viên phải là các chữ số

# InValidMsg_LoginInfomation
source: Username or password is incorrect
vi_vn: Tên đăng nhập hoặc mật khẩu không đúng

# InValidMsg_NotExistInput
source: Data does not exist
vi_vn: Lỗi dữ liệu không tồn tại.

# InValidMsg_OnlyNumberIdentityNumber
source: The identification number must only contain numeric characters
vi_vn: Số căn cước chỉ được chứa ký tự số.

# InValidMsg_OnlyNumberPhone
source: Phone numbers must only contain numeric characters
vi_vn: Số điện thoại chỉ được chứa ký tự số.

# InValidMsg_PasswordRequired
source: Password is required
vi_vn: Mật khẩu không được để trống

# InValidMsg_PhoneNumberTooLong
source: Phone number must not exceed 15 characters
vi_vn: Số điện thoại không được vượt quá 15 kí tự

# InValidMsg_PositionCodeRequired
source: Position code is required
vi_vn: Mã vị trí / chức vụ không được để trống.

# InValidMsg_PositionCodeTooLong
source: Position code must not exceed 20 characters.
vi_vn: Mã vị trí / chức vụ không được quá 20 kí tự.

# InValidMsg_PositionInvalid
source: Invalid position
vi_vn: Vị trí không hợp lệ

# InValidMsg_PositionNameRequired
source: Position name is required
vi_vn: Tên chức vụ không được để trống.

# InValidMsg_SystemError
source: System error
vi_vn: Lỗi hệ thống

# InValidMsg_UnauthorizedUser
source: Invalid token
vi_vn: Token không hợp lệ

# InValidMsg_UserNameRequired
source: Username is required
vi_vn: Tên đăng nhập không được bỏ trống
